#define IN 1
#define OUT 0

char * reverseWords(char * in, char *out)	//функция, переворачивающая слова из in и записывающую их в out
{
	char *arrp[64];	//Массив указателей на char
	int flag = OUT;
	int count = 0;	//Количество слов == количество элементов *arrp[]

	in[strlen(in) - 1] = '\0';	//Заменяем '\n' на '\0'
	//-----------------------------------------------------------------

	//Находим и записываем первые символы всех слов в массив указателей
	for (int i = 0; in[i] != 0; i++)
	{
		if (in[i] != ' ' && flag == OUT)
		{
			flag = IN;
			arrp[count] = &in[i];
			count++;
		}
		else if (in[i] == ' ' && flag == IN)
		{
			flag = OUT;
		}
	}
	//-----------------------------------------------------------------
	//Выполняем формирование новой строки	
	int k = 0;	//Используется для указания сдвига(индекса) в выходном массиве...

	for (int i = count - 1; i >= 0; i--)
	{
		for (int j = 0; arrp[i][j] != ' ' && arrp[i][j] != '\0'; j++)
		{
			out[k] = arrp[i][j];
			k++;
			if (((arrp[i][j+1] == ' ') || (arrp[i][j+1] == '\0')) && (i - 1 >= 0))
			{
				out[k] = ' ';
				k++;
			}
			else if (((arrp[i][j + 1] == ' ') || (arrp[i][j + 1] == '\0')) && (i - 1 < 0))
			{
				out[k] = '\0';
			}
		}
	}
	//-----------------------------------------------------------------
	return out;
}




